"""
-------------------------------------------------
   File Name:python_basic02
   Author:Lee
   date: 2021/5/24-14:20
-------------------------------------------------
"""
"""
本章讲解：变量
"""



print('侬好')

a = '今天天气很好,和你一样'  # a 是一个变量, 把后面的这句话储存在a里面
print(a)  # 打印a的内容   今天天气很好,和你一样

# 声明变量，变量是用来存储值的

# 自动调整格式的快捷键： Ctrl + Alt + L

# ***********知识点1：变量的声明
a = 1  # 该行代码声明了一个变量a，并且赋值1,变量a是整数类型 int
b = 2  # 该行代码声明了一个变量b，并且赋值2,变量b是整数类型 int
print(a + b)  # 3

c = 3.5  # 该行代码声明了一个变量c，并且赋值3.5,变量c是浮点数类型 float
print(b + c)  # 5.5

name = 'xiaohua'  # 该行代码声明了一个变量name，并且赋值 xiaohua,变量name是字符串类型 str

# ***********知识点2：变量的覆盖，变量可以一次声明、多次赋值，后面的值会覆盖前面的值
sal = 100  # 声明sal变量，赋值为100
sal = 500  # 声明sal变量，赋值为500
print(sal)  # 500
sal = sal + 1000  # 先运行sal+1000，再赋值给sal
print(sal)  # 1500

name = 'xiaohua'
print(name)  # xiaohua
name = 'xiaoliu'
print(name)  # xiaoliu

# ***********知识点3：同时为多个变量赋值
# 第一种
a = b = c = 1  # 代表声明了a、b、c三个变量，且值为1
print(a, b, c)  # 1 1 1

# 第二种
A, B, C = 1, 'xiaohua', 5  # 代表声明了三个变量，且赋予不同的值

# ***********知识点4：python是大小写和缩进敏感的编程语言
# 注意：有大小写的区分，sno和Sno 不是同一个变量
sno = 1001
Sno = 1002
print('sno的值是：', sno)  # sno的值是： 1001
print('Sno的值是：', Sno)  # Sno的值是： 1002

print('19班')
#  print('19班')  #该行代码会报错,注意print()前面有个空格,注意缩进问题，一般都是顶格写
