"""
-------------------------------------------------
   File Name:homework
   Author:Lee
   date: 2021/5/27-10:11
-------------------------------------------------
"""
# 随机数
import random  # import是导入的意思，random模块提供了随机相关功能，我们需要导入这个模块才能使用相关的功能

rm = random.randint(1, 3)  # 代表随机[1,3]   random.randint 功能提供了随机产生整数的功能
print(rm)

str1 = random.choice(['xiaohua', 'xiaoliu', 'xiaoli'])
print(str1)

# 练习1：随机班级点名器
names = ['韩彦文', '黄宏伟', '周开佺', '吴凌峰', '许梦瑶', '汪学辉', '杨志得', '吴小霜', '刘娟', '凡丙馨', '张棚亮',
         '田皓文', '齐艳伶', '韩青', '朱姗姗', '黄圆',
         '熊海燕', '林喆', '张鸣铭', '窦玉', '孙玉莹', '杨苏安', '王丹丹', '邓居快', '洪至诚', '李洁', '陈玲玲', '李雪',
         '冯一帅', '童贤龙', '何婷', '张变兰',
         '童贤凤', '方莹', '李俊平', '左婵', '王空', '王琰', '张旭东', '陈鸿树', '连文凯', '曹珊', '杨双玲',
         '陈佩佩', '谢文涛', '方爱君', '王丽', '黄佳琪',
         '田苗苗', '周桐', '詹学勤']
name = random.choice(names)
print(name)
