"""
-------------------------------------------------
   File Name:python_basic33
   Author:Lee
   date: 2021/5/27-17:17
-------------------------------------------------
"""
"""
本章讲解：分支嵌套
语法：
if 条件1：
    if 条件2：
        语句块2
    else:
        语句块3
else:
    语句块4
"""

# case： 西北玄天一片云，乌鸦落在凤凰群。满车都是英雄汉，谁是君来谁是臣

code1 = input('兄台，西北玄天一片云，来接下一句：')

if code1 == '乌鸦落在凤凰群':
    code2 = input('满车都是英雄汉，下一句？')
    if code2 == '谁是君来谁是臣':
        print('自己人，快进山寨')
    else:
        print('你到底是什儿人？')
else:
    print('下次再来宰了你')
    print('快走')
