"""
-------------------------------------------------
   File Name:python_basic32
   Author:Lee
   date: 2021/5/27-15:24
-------------------------------------------------
"""
"""
本章讲解：多分支条件判断
语法：
if 条件1：
    语句块1
elif 条件2：
    语句块2
elif 条件3：
    语句块3
.....
[else：
    语句块4]

"""

# 一般来说： 0-6岁婴儿，7-12岁为少儿，13-17岁为青少年，18-45岁为青年，46-69岁为中年，大于69岁老年
age = int(input('请输入年龄：'))

if 0 < age <= 6:
    print('婴幼儿阶段，好好玩耍')
elif 6 < age <= 12:
    print('好好学习天天向上')
elif 12 < age <= 17:
    print('青少年阶段,学习')
elif 17 < age <= 45:
    print('努力拼搏，争取老板明年换车')
elif 45 < age <= 69:
    print('带娃，享受生活')
else:  # 如果以上所有的情况都不满足，执行else下的语句块
    print('老年阶段，好好活着')

# 自己想个多分支逻辑(至少4个分支)

sal = int(input('请输入年收入：'))
if 0 < sal <= 30000:
    print('贫困家庭')
elif 30000 < sal <= 80000:
    print('低收入家庭')
elif 80000 < sal <= 300000:
    print('小康家庭')
elif 300000 < sal <= 1000000:
    print('中高收入家庭')
elif sal > 1000000:
    print('高收入家庭')
else:
    print('乞丐')
